#+TITLE: Julia Notebook with Org mode 
#+AUTHOR: GTrunSec
#+EMAIL: gtrunsec@hardenedlinux.org
#+DATE: 26 August 2020
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en cn
#+SETUPFILE: ~/Documents/my-blog/public/theme/org-html-themes/setup/theme-readtheorg.setup
#+hugo_publishdate: (0 5)
#+hugo_auto_set_lastmod: t
#+HUGO_categories:
#+HUGO_tags:
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+PROPERTY: header-args:sh :prologue "exec 2>&1" :epilogue ":"
* Clone Repo
- JuliaTutorial


#+begin_src sh :async t :exports both :results output
git clone https://github.com/GTrunSec/JuliaTutorial.git
#+end_src

#+RESULTS:

- julia_tutorials

  #+begin_src sh :async t :exports both :results output
git clone https://github.com/GTrunSec/julia_tutorials.git
  #+end_src


* Julia with org babel
#+begin_src julia :async t :exports both :results output
1 + 334
#+end_src

#+RESULTS:
: 335
